In [1]:
import pandas as pd

In [2]:
dados_pessoas = pd.read_excel('dados.xlsx', sheet_name='pessoas')
dados_notas = pd.read_excel('dados.xlsx', sheet_name='notas')

In [3]:
dados_pessoas

     nome  idade
0  rafael     15
1    joao     10
2   maria     18
3  mateus     12
4   pedro     11
5     ana     19

In [4]:
# dentro da variavel notas, a coluna nome é a variavel chave,
# que está fazendo um join com data frame dados pessoas, informando que o nome é a chave.
dados_todos = dados_notas.set_index('nome').join(dados_pessoas.set_index('nome'))

In [5]:
dados_todos

        semestre  nota  idade
nome
ana            1    10     19
ana            2     6     19
joao           1     4     10
joao           2     8     10
maria          1     9     18
maria          2     6     18
mateus         1     8     12
mateus         2     9     12
pedro          1     7     11
pedro          2     8     11
rafael         1     7     15
rafael         2    10     15

In [6]:
# Esté fazndo um agrupamento por nome com dados_todos
# define qual a coluna que exibe o resultado. Nota
medias = dados_todos.groupby('nome').nota.mean()

In [7]:
medias

nome
ana       8.0
joao      6.0
maria     7.5
mateus    8.5
pedro     7.5
rafael    8.5
Name: nota, dtype: float64

In [8]:
# A máxima nota de cada pessoas
maxima = dados_todos.groupby('nome').nota.max()
maxima

nome
ana       10
joao       8
maria      9
mateus     9
pedro      8
rafael    10
Name: nota, dtype: int64

In [9]:
medias.to_excel('saida.xlsx')